Benchmark_files/output_cluster_read_t8_1.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)
 
 Running the test with following options:
 Number of threads: 8
 Initializing random number generator from current time
 
 
 Initializing worker threads...
 
 Threads started!
 
 Latency histogram (values are in milliseconds)
        value  ------------- distribution ------------- count
        1.443 |                                         5
        1.469 |*                                        18
        1.496 |**                                       39
        1.523 |****                                     81
        1.551 |****                                     83
        1.579 |***                                      59
        1.608 |**                                       35
        1.637 |*                                        24
        1.667 |*                                        11
        1.697 |                                         10
        1.728 |                                         2
        1.759 |                                         4
        1.791 |                                         1
        1.824 |                                         1
        1.960 |                                         1
        2.069 |                                         1
        2.223 |                                         1
        2.433 |                                         1
        2.615 |                                         1
        2.662 |                                         1
        2.861 |                                         1
        2.966 |                                         1
        3.020 |                                         2
        3.075 |                                         4
        3.130 |                                         2
        3.187 |                                         3
        3.245 |                                         3
        3.364 |                                         2
        3.425 |                                         1
        3.488 |                                         1
        4.176 |                                         1
        4.329 |                                         1
        4.407 |                                         1
        4.487 |                                         4
        4.569 |                                         1
        4.652 |                                         3
        4.737 |                                         2
        4.823 |                                         5
        4.910 |                                         5
        4.999 |                                         4
        5.090 |                                         3
        5.183 |                                         4
        5.277 |                                         2
        5.570 |                                         1
        5.671 |                                         1
        5.774 |                                         2
        5.879 |                                         1
        5.986 |                                         2
        6.095 |                                         6
        6.205 |                                         6
        6.318 |                                         5
        6.433 |                                         1
        6.550 |                                         9
        6.669 |                                         6
        6.790 |                                         3
        6.913 |                                         3
        7.039 |                                         4
        7.167 |                                         2
        7.297 |                                         2
        7.430 |                                         2
        7.565 |                                         3
        7.702 |                                         5
        7.842 |                                         10
        7.985 |                                         5
        8.130 |                                         9
        8.277 |                                         7
        8.428 |                                         5
        8.581 |                                         7
        8.737 |                                         4
        8.895 |                                         5
        9.057 |*                                        11
        9.222 |                                         10
        9.389 |*                                        11
        9.560 |*                                        19
        9.734 |*                                        20
        9.910 |*                                        11
       10.090 |*                                        13
       10.274 |*                                        13
       10.460 |*                                        30
       10.651 |**                                       50
       10.844 |****                                     78
       11.041 |****                                     90
       11.242 |*****                                    102
       11.446 |*****                                    108
       11.654 |******                                   119
       11.866 |*******                                  141
       12.081 |***************                          307
       12.301 |**************************               544
       12.524 |**************************************** 838
       12.752 |***********************************      728
       12.984 |***********************                  475
       13.219 |***********                              221
       13.460 |*******                                  148
       13.704 |*******                                  146
       13.953 |******                                   131
       14.207 |********                                 161
       14.465 |*****                                    114
       14.728 |**                                       51
       14.995 |**                                       42
       15.268 |**                                       33
       15.545 |*                                        21
       15.828 |*                                        21
       16.115 |*                                        26
       16.408 |*                                        12
       16.706 |                                         6
       17.010 |                                         8
       17.319 |                                         10
       17.633 |*                                        12
       17.954 |*                                        12
       18.280 |                                         6
       18.612 |*                                        15
       18.950 |*                                        12
       19.295 |                                         10
       19.645 |*                                        19
       20.002 |                                         8
       20.366 |*                                        21
       20.736 |*                                        17
       21.112 |**                                       37
       21.496 |**                                       37
       21.886 |**                                       42
       22.284 |****                                     75
       22.689 |***                                      64
       23.101 |*****                                    99
       23.521 |****                                     88
       23.948 |****                                     77
       24.384 |**                                       33
       24.827 |*                                        22
       25.278 |*                                        11
       25.737 |                                         8
       26.205 |                                         4
       26.681 |                                         6
       29.194 |                                         1
       29.725 |                                         1
       30.815 |                                         1
  
 SQL statistics:
     queries performed:
         read:                            86212
         write:                           0
         other:                           12316
         total:                           98528
     transactions:                        6158   (614.85 per sec.)
     queries:                             98528  (9837.57 per sec.)
     ignored errors:                      0      (0.00 per sec.)
     reconnects:                          0      (0.00 per sec.)
 
 General statistics:
     total time:                          10.0131s
     total number of events:              6158
 
 Latency (ms):
          min:                                    1.45
          avg:                                   12.99
          max:                                   30.56
          95th percentile:                       23.10
          sum:                                80008.01
 
 Threads fairness:
     events (avg/stddev):           769.7500/3.07
     execution time (avg/stddev):   10.0010/0.00